# Напишите программу, которая принимает на вход цифру,
#  обозначающую день недели, и проверяет является ли этот день выходным.
#  Пример: 6-да, 7 - да, 1 - нет

# number = int(input('Введите число: '))
# if number in range(1,8):
#     if number >0 and number <= 5:
#         print('будни')
#     else:
#         print('выходной') 
# else:
#     print('Введите число в диапазоне от 1 до 7')        


#Напишимте программу, для проверки истинности утверждения


# for x in (0,1):
#     for y in (0,1):
#         for z in (0,1):
#             print(x, y, z)
#             print(not (x or y or z) == ((not )and (not y) and (not z)))
 

# Напишитк программу, которая принимает на вход координаты x и y, причем x  не равен нулю и y не равен нулю
#  и выдаёт номер четверти плоскости в которой находится эта точка
 

# x = float(input('Введите координаты x: '))
# y = float(input('Введите координаты y: '))
# if x > 0 and y >0:
#     print(1)
# if x < 0 and y > 0:
#     print(2)
# if x < 0 and y < 0:
#     print(2) 
# else:
#     print(4)           


# Task 9
# Напишите программу, которая по заданному номеру четверти
# показывает диапазон возможных координат точек в этой четверти(x и y)



# number = int(input('Введите номер четверти x: '))

# number = int(input('Введите номер четверти: '))

# for x,y in range(1, len):
#     if number == 1:
#         print('x > 0 and y >0')
#     elif number ==2:
#         print('x < 0 and y > 0')
#     elif  number == 3:
#         print ('x < 0 and y < 0')
# else:
#     print('x > 0 and y < 0')

# 
#Task10
#  Напишите программу, которая принимает на вход координаты 2х
#  точек и находит расстояние между ними 2D пространстве4
# import math
# x1, y1 = int(input()), int(input())
# x2, y2 = int(input()), int(input())
# bc = x1 -x2
# ac = y2 -y1
# print(math.sqrt(ac ** 2 + bc **2))












